IDENTIFICATION DIVISION.
PROGRAM-ID. READHUGE.

ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT INPUTFILE ASSIGN TO 'input.txt'
      ORGANIZATION IS LINE SEQUENTIAL.            

DATA DIVISION.
   FILE SECTION.
   FD INPUTFILE.
   01 INPUTFILE-FILE.
      05 INPUTFILE-ID PIC 9(16).

   WORKING-STORAGE SECTION.
   01 WS-INPUTFILE.
      05 WS-INPUTFILE-ID PIC 9(16).
   01 WS-EOF PIC A(1). 
   01 WS-TOTAL PIC 9(16). 

PROCEDURE DIVISION.
   OPEN INPUT INPUTFILE.
      PERFORM UNTIL WS-EOF='Y'
         READ INPUTFILE INTO WS-INPUTFILE
            AT END MOVE 'Y' TO WS-EOF
            NOT AT END COMPUTE WS-TOTAL = WS-TOTAL + WS-INPUTFILE-ID
         END-READ
      END-PERFORM.
   DISPLAY  WS-TOTAL
   CLOSE INPUTFILE.
STOP RUN.